In [12]:
import pandas as pd
a = pd.Series({'1차': 100, '2차' : 91, '3차' : 35, '4차' : 95, '5차' : 99})
b = pd.Series({'1차': 90, '2차' : 22, '3차' : 55, '4차' : 91, '5차' : 90})
c = pd.Series({'1차': 50, '2차' : 41, '3차' : 45, '4차' : 91, '5차' : 29})
d = pd.Series({'1차': 40, '2차' : 71, '3차' : 78, '4차' : 96, '5차' : 45})
e = pd.Series({'1차': 60, '2차' : 41, '3차' : 35, '4차' : 91, '5차' : 95})
columns = ['1차','2차','3차','4차','5차']
index =['a','b','c','d','e']
df = pd.DataFrame(data = [a,b,c,d,e],index = index, columns = columns)

In [13]:
df

    1차  2차  3차  4차  5차
a  100  91  35  95  99
b   90  22  55  91  90
c   50  41  45  91  29
d   40  71  78  96  45
e   60  41  35  91  95

In [15]:
# 전치행렬, 하지만 df.T는 데이터 자체가 바뀌는게 아님 보이는것만
df.T

      a   b   c   d   e
1차  100  90  50  40  60
2차   91  22  41  71  41
3차   35  55  45  78  35
4차   95  91  91  96  91
5차   99  90  29  45  95

In [20]:
data = {
    '국어' : [80,90,70,90],
    '영어' : [90,70,60,40],
    '수학' : [90,60,80,70]
}
columns = ['국어','영어','수학']
index = ['춘향','몽룡','향단','방자']
df = pd.DataFrame(data, index = index, columns = columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  90  40  70

In [22]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [51]:
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  90  40

In [56]:
df['평균'] = df.mean(axis=1)
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  90  40  70  66.666667

In [67]:
df['영어']['방자'] = 80
df

<ipython-input-67-03ae12f453d2>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학    평균
춘향  80  90  90  85.0
몽룡  90  70  60  77.5
향단  70  60  80  70.0
방자  90  80  70  82.5

In [68]:
df[:1]

    국어  영어  수학    평균
춘향  80  90  90  85.0

In [69]:
df.iloc[2]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [71]:
df.T[:2]

      춘향    몽룡    향단    방자
국어  80.0  90.0  70.0  90.0
영어  90.0  70.0  60.0  80.0

In [72]:
df[:2]

    국어  영어  수학    평균
춘향  80  90  90  85.0
몽룡  90  70  60  77.5